-- Task1
select distinct Н_ЛЮДИ.ИД, Н_СЕССИЯ.ЧЛВК_ИД from
Н_ЛЮДИ inner join
Н_СЕССИЯ on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
where Н_ЛЮДИ.ИД = 142095;



select distinct Н_ЛЮДИ.ИД, Н_СЕССИЯ.ЧЛВК_ИД from
Н_ЛЮДИ inner join
Н_СЕССИЯ on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
where Н_ЛЮДИ.ИД = 101899;



select distinct Н_ЛЮДИ.ИД, Н_СЕССИЯ.ЧЛВК_ИД from
Н_ЛЮДИ inner join
Н_СЕССИЯ on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
where Н_СЕССИЯ.УЧГОД < '2001/2002';



select distinct Н_ЛЮДИ.ИД, Н_СЕССИЯ.ЧЛВК_ИД from
Н_ЛЮДИ inner join
Н_СЕССИЯ on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
where Н_СЕССИЯ.УЧГОД < '2008/2009';



-- Task2
select distinct Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.ЧЛВК_ИД from Н_ЛЮДИ
inner join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД inner join Н_СЕССИЯ
on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
where Н_ЛЮДИ.ФАМИЛИЯ = 'Ёлкин';



select distinct Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.ЧЛВК_ИД from Н_ЛЮДИ
inner join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД inner join Н_СЕССИЯ
on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
where Н_ЛЮДИ.ФАМИЛИЯ = 'Мандриков';



select distinct Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.ЧЛВК_ИД from Н_ЛЮДИ
inner join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД inner join Н_СЕССИЯ
on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
where Н_ВЕДОМОСТИ.ЧЛВК_ИД < 153285;



-- Task3
select count(*) from (select ДАТА from Н_ВЕДОМОСТИ group by ДАТА) as unique_dates;



-- Task4
select Н_ЛЮДИ.ОТЧЕСТВО, count(*) as count 
from Н_ЛЮДИ 
inner join Н_УЧЕНИКИ on Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД 
inner join Н_ПЛАНЫ on Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД 
inner join Н_ОТДЕЛЫ on Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД 
where Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ' 
group by Н_ЛЮДИ.ОТЧЕСТВО having count(*) < 50;



-- Task5
select Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО, avg(cast(Н_ВЕДОМОСТИ.ОЦЕНКА as numeric))
from Н_ЛЮДИ
inner join Н_УЧЕНИКИ on Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД 
inner join Н_ВЕДОМОСТИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
where Н_УЧЕНИКИ.ГРУППА = '4100' and Н_ВЕДОМОСТИ.ОЦЕНКА in ('1','2','3','4','5')
group by Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
having avg(cast(Н_ВЕДОМОСТИ.ОЦЕНКА as numeric)) >= 
(select avg(mean_mark) from
(select avg(cast(Н_ВЕДОМОСТИ.ОЦЕНКА as numeric)) as mean_mark
from Н_ВЕДОМОСТИ 
inner join Н_УЧЕНИКИ on Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
where Н_УЧЕНИКИ.ГРУППА = '1100' and Н_ВЕДОМОСТИ.ОЦЕНКА in ('1','2','3','4','5')
group by Н_ВЕДОМОСТИ.ЧЛВК_ИД) as subquery);



-- Task 5 check mean for group 1100
(select avg(mean_mark) from
(select avg(cast(Н_ВЕДОМОСТИ.ОЦЕНКА as numeric)) as mean_mark
from Н_ВЕДОМОСТИ 
inner join Н_УЧЕНИКИ on Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
where Н_УЧЕНИКИ.ГРУППА = '1100' and Н_ВЕДОМОСТИ.ОЦЕНКА in ('1','2','3','4','5')
group by Н_ВЕДОМОСТИ.ЧЛВК_ИД) as subquery);



-- Task6
select Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО,Н_УЧЕНИКИ.П_ПРКОК_ИД
from Н_УЧЕНИКИ
join Н_ЛЮДИ on Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
join Н_ПЛАНЫ on Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
join Н_ФОРМЫ_ОБУЧЕНИЯ on Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
and Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
join Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ on Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
join Н_НАПР_СПЕЦ on Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
and Н_НАПР_СПЕЦ.НАИМЕНОВАНИЕ = 'Программная инженерия'
where Н_УЧЕНИКИ.ИД in (
select Н_УЧЕНИКИ.ИД from Н_УЧЕНИКИ
where Н_УЧЕНИКИ.ПРИЗНАК = 'отчисл'
and Н_УЧЕНИКИ.КОНЕЦ < '2012-09-01'::timestamp);



-- Task7
select Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_ЛЮДИ.ИД as Person_Id, Н_УЧЕНИКИ.ЧЛВК_ИД as Student_ID
from Н_ЛЮДИ
left join Н_УЧЕНИКИ on Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
where Н_УЧЕНИКИ.ЧЛВК_ИД is null;




